<?php

class Code {

    /**
     * 返回码
     * @var array
     */
    public static $code =  [
        // bannerList
        1000 => '获取bannerList成功',

        // listHotMessageAction
        1100 => '帖子列表获取成功',

        // infoMessageAction
        1200 => '帖子内容获取成功',

        // likeMessageAction
        1300 => '帖子不存在',
        1301 => '帖子点赞成功',

        // passwordLoginAction
        1400 => '手机号输入有误',
        1401 => '密码输入有误',
        1402 => '手机号没有注册',
        1403 => '密码错误',
        1404 => '登陆成功',

        // getResetPasswordCodeAction
        1500 => '手机号输入有误',
        1501 => '请不要重复获取',
        1502 => '手机号没有注册',
        1503 => '系统异常：验证码发送失败',
        1504 => '验证码已经发送',

        // resetPasswordAction
        1600 => '手机号输入有误',
        1601 => '验证输入有误',
        1602 => '密码输入有误',
        1603 => '两次输入的密码不一致',
        1604 => '验证码验证码失败',
        1605 => '系统异常：密码重置失败',
        1606 => '密码重置成功',


        // getRegisterCodeAction
        1700 => '手机号输入有误',
        1701 => '请不要重复获取',
        1702 => '手机号已经注册',
        1703 => '系统异常：验证码发送失败',
        1704 => '验证码已经发送',

        // registerAction
        1800 => '手机号输入有误',
        1801 => '验证输入有误',
        1802 => '头像选择有误',
        1803 => '昵称不能为空',
        1810 => '简介输入有误',
        1811 => '密码输入有误',
        1812 => '两次输入的密码不一致',
        1813 => '验证码验证码失败',
        1814 => '系统异常：注册失败',
        1815 => '注册成功',

        // addMessage
        1900 => '发布类型不符',
        1901 => '发布分类有误',
        1902 => '发布人有误',
        1904 => '标题不能为空',
        1906 => '标题超过255汉字长度',
        1908 => '发布失败',
        1910 => '请不要重复发布',
        1912 => '发布成功',

        // listCategoryAction
        2000 => '获取分类列表成功',

        // likeUserAction
        2100 => '用户不存在',
        2102 => '已经关注',
        2104 => '关注成功',
        2106 => '关注失败',
        2108 => '系统异常，关注失败',
    ];

}
